[
  {
    "date": "2025-12-15",
    "title": "Intrinsic Geometry of Operational Contexts: A Riemannian-Style Framework for Quantum Channels",
    "authors": "Kazuyuki Yoshida",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2512.12944v1",
    "source": "arXiv",
    "abstract": "We propose an intrinsic geometric framework on the space of operational contexts, specified by channels, stationary states, and self-preservation functionals. Each context C carries a pointer algebra, internal charges, and a self-consistent configuration minimizing a self-preservation functional. The Hessian of this functional yields an intrinsic metric on charge space, while non-commutative questioning loops dN -> dPhi -> d rho^circ define a notion of curvature. In suitable regimes, this N-Q-S geometry reduces to familiar Fisher-type information metrics and admits charts that resemble Riemannian or Lorentzian space-times. We outline how gauge symmetries and gravitational dynamics can be interpreted as holonomies and consistency conditions in this context geometry."
  },
  {
    "date": "2025-12-15",
    "title": "Phase-field simulation of domain switching in ferroelectric trilayer films under bending-induced strain gradient",
    "authors": "Changqing Guo, Letao Yang, Jing Wang, Houbing Huang",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2512.12943v1",
    "source": "arXiv",
    "abstract": "Flexible ferroelectrics possess significant potential for wearable electronics and bio-inspired devices, yet their electromechanical coupling mechanisms under dynamic bending remain elusive. This study employs phase-field simulations to investigate the effects of bending deformation on domain structures and macroscopic ferroelectric responses in (SrTiO3)10/(PbTiO3)10/(SrTiO3)10 trilayer films. By constructing computational models for upward-concave (U-shaped) and downward-concave (N-shaped) configurations, we analyze the regulation of polarization patterns by strain distributions under varying curvature radii. The results demonstrate that the two bending modes generate opposite through-thickness strain gradients: U-shaped bending produces compressive strain in the upper layer and tensile strain in the lower, while N-shaped bending yields the reverse. These inhomogeneous strains drive distinct polarization reconfigurations within the PTO layer. While stable vortex-antivortex pairs persist at moderate curvatures, reducing the bending radius triggers divergent topological transitions -- U-shaped bending transforms vortex pairs into zigzag-like domains, whereas N-shaped bending promotes out-of-plane c-domain evolution. Crucially, bending-induced strain gradients generate transverse flexoelectric fields that markedly modulate hysteresis loops. U-shaped bending introduces a negative flexoelectric field, shifting loops rightward and suppressing maximum polarization Pmax. In contrast, N-shaped bending generates a positive field, shifting loops leftward and enhancing Pmax. Furthermore, analysis of polarization switching reveals that bending mediates domain-evolution pathways and reversal dynamics."
  },
  {
    "date": "2025-12-15",
    "title": "UAGLNet: Uncertainty-Aggregated Global-Local Fusion Network with Cooperative CNN-Transformer for Building Extraction",
    "authors": "Siyuan Yao, Dongxiu Liu, Taotao Li, Shengjie Li, Wenqi Ren, Xiaochun Cao",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2512.12941v1",
    "source": "arXiv",
    "abstract": "Building extraction from remote sensing images is a challenging task due to the complex structure variations of the buildings. Existing methods employ convolutional or self-attention blocks to capture the multi-scale features in the segmentation models, while the inherent gap of the feature pyramids and insufficient global-local feature integration leads to inaccurate, ambiguous extraction results. To address this issue, in this paper, we present an Uncertainty-Aggregated Global-Local Fusion Network (UAGLNet), which is capable to exploit high-quality global-local visual semantics under the guidance of uncertainty modeling. Specifically, we propose a novel cooperative encoder, which adopts hybrid CNN and transformer layers at different stages to capture the local and global visual semantics, respectively. An intermediate cooperative interaction block (CIB) is designed to narrow the gap between the local and global features when the network becomes deeper. Afterwards, we propose a Global-Local Fusion (GLF) module to complementarily fuse the global and local representations. Moreover, to mitigate the segmentation ambiguity in uncertain regions, we propose an Uncertainty-Aggregated Decoder (UAD) to explicitly estimate the pixel-wise uncertainty to enhance the segmentation accuracy. Extensive experiments demonstrate that our method achieves superior performance to other state-of-the-art methods. Our code is available at https://github.com/Dstate/UAGLNet"
  },
  {
    "date": "2025-12-15",
    "title": "Predicting the Thermal Conductivity Collapse in SWCNT Bundles: The Interplay of Symmetry Breaking and Scattering Revealed by Machine-Learning-Driven Quantum Transport",
    "authors": "Feng Tao, Xiaoliang Zhang, Dawei Tang, Shigeo Maruyama, Ya Feng",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2512.12940v1",
    "source": "arXiv",
    "abstract": "We combine machine learning (ML)-based neuroevolution potentials (NEP) with anharmonic lattice dynamics and the Boltzmann transport equation (ALD-BTE) to achieve a quantitative and mode-resolved description of thermal transport in individual (10, 0) zigzag single-walled carbon nanotubes (SWCNTs) and their bundles. Our analysis reveals a dual mechanism behind the drastic suppression of thermal conductivity in bundles: first, the breaking of rotational symmetry in isolated SWCNTs dramatically enhances the scattering rates of symmetry-sensitive phonon modes, such as the twist (TW) mode. Second, the emergence of new inter-tube phonon modes introduces abundant additional scattering channels across the entire frequency spectrum. Crucially, the incorporation of quantum Bose-Einstein (BE) statistics is essential to accurately capture these phenomena, enabling our approach to quantitatively reproduce experimental observations. This work establishes the combination of ML-driven interatomic potentials and ALD-BTE as a predictive framework for nanoscale thermal transport, effectively bridging the gap between theoretical models and experimental measurements."
  },
  {
    "date": "2025-12-15",
    "title": "Realizations and Uniqueness of Cut Complexes of Graphs",
    "authors": "Yufeng Shen, Zhiyu Song, Fenglin Yu, Leopold Wuhan Zhou, Jingqi Zhuang",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2512.12933v1",
    "source": "arXiv",
    "abstract": "In this paper, we investigate three fundamental problems regarding cut complexes of graphs: their realizability, the uniqueness of graph reconstruction from them, and their algorithmic recognition. We define the parameter $m(d,n)$ as the minimum number of additional vertices needed to realize any $d$-dimensional simplicial complex on $n$ vertices as a cut complex, and prove foundational bounds. Furthermore, we characterize precisely when a graph on $n \\geq 5$ vertices is uniquely reconstructible from its $3$-cut complex. Based on this characterization, we develop an $O(n^4)$ recognition algorithm. These results deepen the connection between graph structure and the topology of cut complexes."
  },
  {
    "date": "2025-12-15",
    "title": "Susurros",
    "authors": "Alexandra Pewinski, Marie Lombard, Florian Reignier, Emma Pluchard, Lisa Francillon, Alice Parmentier, Philippe Meis",
    "publish": "SIGGRAPH Asia 2025 Computer Animation Festival",
    "url": "https://doi.org/10.1145/3757370.3770794",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2025-12-15",
    "title": "Le Cocon",
    "authors": "Aurélien Coquery, Léa Kermanach, Soline Mauguin, Abel Tixador, Jean Baounon, Romane Selter-Fiette, Philippe Meis",
    "publish": "SIGGRAPH Asia 2025 Computer Animation Festival",
    "url": "https://doi.org/10.1145/3757370.3770795",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2025-12-15",
    "title": "Kamarade",
    "authors": "Garance Valere, Valentin Okoundou, Hubert Chauvaux, Alice Bourget, Louise Laurent, Fleuriane Le Guillou, Philippe Meis",
    "publish": "SIGGRAPH Asia 2025 Computer Animation Festival",
    "url": "https://doi.org/10.1145/3757370.3770797",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2025-12-15",
    "title": "Improving Trans-Esophageal Echocardiography: A Miniaturized Cooling System",
    "authors": "Francesca Parrotta, Giovanni Faoro, Selene Tognarelli, Alberto Giannoni, Arianna Menciassi",
    "publish": "IEEE Transactions on Medical Robotics and Bionics",
    "url": "https://doi.org/10.1109/tmrb.2025.3643910",
    "source": "IEEE",
    "abstract": "Minimally Invasive Surgery (MIS) for cardiac procedures was adopted in the late 90s as a valid alternative to open-heart surgeries, allowing for a minor operative trauma and a faster post-operative recovery. In the context of MIS, the presence of accurate imaging techniques is of paramount importance, as surgeons operate without a direct view of the surgical site. Nowadays, fluoroscopic and ultrasound (US) images, using a Trans-Esophageal probe, are simultaneously employed. The development of real-time three-dimensional Trans-Esophageal Echocardiography has enabled the execution of various trans-catheter procedures. However, recent studies have highlighted the occurrence of esophageal lesions following TEE-guided cardiac interventions. Specifically, blind probe insertion and repeated adjustment for optimal instrument guidance, along with prolonged use-induced heating, appear to be the primary causes of complications. The major reason for using a dual imaging technique is that commercial probes automatically switch off once a temperature threshold of approximately 42.5∘C is reached; for safety reasons related to potential thermal damage to the internal walls of the esophagus. Based on numerical simulations and experimental results, a miniaturized cooling device for TEE probes is proposed, thus reinforcing the reliability of US images in the intraoperative scenario, as they are completely harmless to both patients and doctors. The proposed system consists of a silicone cap incorporating an internal cooling circuit. It does not interfere with the clinical workflow, effectively maintains the probe within a safe temperature range for the entire duration of a surgical procedure, and does not compromise intraoperative image quality."
  },
  {
    "date": "2025-12-15",
    "title": "Pseudo-label Guided Multi-task Learning for Abdominal Multi-branch Vascular Segmentation from Partially Labeled DSA Datasets",
    "authors": "Meng Song, Kang Li, Shiqi Liu, Xiaoliang Xie, Xiaohu Zhou, Zengguang Hou, Linsen Zhang, Zhichao Lai, Bao Liu",
    "publish": "IEEE Transactions on Automation Science and Engineering",
    "url": "https://doi.org/10.1109/tase.2025.3644660",
    "source": "IEEE",
    "abstract": "Accurate segmentation of multi-branched blood vessels from Digital Subtraction Angiography (DSA) images is essential to improve efficiency and safety of vascular interventional procedures. However, the high-speed flow of contrast agents may lead to incomplete visualization of multiple blood vessel branches and unclear boundary contours, resulting in the so-called partial labeling issue. This significantly undermines the network’s ability to extract and understand the features of multi-branched vascular structures with uncertain region, thereby severely impairing the accuracy of the recognition results. In this paper, we introduce a novel pseudo-label guided multi-task learning strategy, capable of effectively learning feature representation completion under partial label supervision. Specifically, a pretext task branch that generates boundary pseudo-label signals extracts absence structural information and transfers it to the target task for multi-branch vascular segmentation. To achieve more precise semantic-supplementing between tasks, an affinity-based criss-cross feature propagation (CCFP) module is designed to dynamically fill semantic and structural voids caused by missing categories. Furthermore, to mitigate performance degradation caused by unreliable pseudo-labels, a unique loss function is proposed to constrain redundant information at both the pixel and structural levels. We validate our approach through the creation of an in-house DSA dataset composed of six sub-datasets, each containing different vascular branches. Extensive experimental results demonstrate that our method not only addresses the challenge of partial labeling but also strikes a balance between pixel-wise accuracy and the preservation of structural integrity, offering potential value in the field of clinical applications."
  }
]