[
  {
    "date": "2026-2-20",
    "title": "Time Travel: LLM-Assisted Semantic Behavior Localization with Git Bisect",
    "authors": "Yujing Wang, Weize Hong",
    "publish": "2025 IEEE Smart World Congress (SWC)",
    "url": "https://doi.org/10.1109/swc65939.2025.00299",
    "source": "IEEE",
    "abstract": "We present a novel framework that integrates Large Language Models (LLMs) into the Git bisect process for semantic fault localization. Traditional bisect assumes deterministic predicates and binary failure states—assumptions often violated in modern software development due to flaky tests, non- monotonic regressions, and semantic divergence from upstream repositories. Our system augments bisect traversal with structured chain-of-thought reasoning, enabling commit-by-commit analysis under noisy conditions. We evaluate multiple open-source and proprietary LLMs for their suitability, and fine-tune DeepSeek- Coder-V2 using QLoRA on a curated dataset of semantically labeled diffs. We adopt a weak-supervision workflow to reduce annotation overhead, incorporating human-in-the-loop corrections and self-consistency filtering. Experiments across multiple open- source projects show a 6.4-point absolute gain in success rate (from 74.2% to 80.6%), leading to significantly fewer failed traversals and—by experiment—up to 2x reduction in average bisect time. We conclude with discussions on temporal reasoning, prompt design, and fine-tuning strategies tailored for commit-level behavior analysis."
  },
  {
    "date": "2026-2-20",
    "title": "Scene Chinese Recognition with Mix Attention and LLM",
    "authors": "Xiahan Yang, Hui Zheng, Yinting Wang",
    "publish": "2025 IEEE Smart World Congress (SWC)",
    "url": "https://doi.org/10.1109/swc65939.2025.00166",
    "source": "IEEE",
    "abstract": "Scene text recognition is a challenging task due to the inter-class similarity and intra-class variations of Chinese characters. To address these issues, this paper proposes the MANet model, which consists of a mixed attention mechanism and GPT. The model first extracts features using Local Attention (LA) and Global Attention (GA), where LA focuses on local information and GA captures long-range dependencies. Then, an encoder-decoder structure is used for text encoding, followed by GPT for semantic refinement, optimizing the recognition of characters with hierarchical relationships. Experimental results on the Chinese Scene dataset show that MANet achieves an accuracy of 77.92%, demonstrating its effectiveness and advantage in scene text recognition."
  },
  {
    "date": "2026-2-20",
    "title": "Counterfactual Adversarial Learning for Fair LLM Recommenders",
    "authors": "Xiangwei Wang, Haolong Xiang, Hongsheng Dong, Xiaolong Xu",
    "publish": "2025 IEEE Smart World Congress (SWC)",
    "url": "https://doi.org/10.1109/swc65939.2025.00118",
    "source": "IEEE",
    "abstract": "Large Language Models (LLMs) have driven transformative advancements in recommender systems through their superior semantic understanding and logical reasoning capabilities. However, the fairness risks embedded in implicit feedback within LLM-based Recommender Systems (LRS) remain understudied—recommendation homogeneity induced by similar behavioral patterns may amplify societal biases, leading to systematic marginalization of disadvantaged groups. To address this challenge, we propose a fairness enhancement framework integrating counterfactual reasoning and dynamic adversarial learning. By constructing counterfactual text intervention scenarios, we uncover implicit causal dependencies between user-sensitive attributes and recommendation decisions. Furthermore, we design a hierarchical gradient blocking mechanism that adaptively suppresses sensitive information propagation pathways during adversarial training, achieving balanced optimization between recommendation fairness and utility. Experimental results demonstrate that our framework effectively mitigates implicit feedback bias at both group and individual levels across multiple benchmarks, significantly improving recommendation equity while maintaining personalized recommendation quality. This study establishes a novel paradigm for LRS that harmonizes semantic understanding with fairness constraints, paving new avenues for ethical alignment in generative recommendation system."
  },
  {
    "date": "2026-2-20",
    "title": "Dynamic Therapeutic Style Adaptation in LLM-based Chatbots: A Psychologist ChatBot",
    "authors": "Dhriti Chandan, Soumyalatha Naveen",
    "publish": "2025 IEEE 22nd India Council International Conference (INDICON)",
    "url": "https://doi.org/10.1109/indicon68490.2025.11392985",
    "source": "IEEE",
    "abstract": "The worldwide demand for easily accessible mental health care calls for conversational AI systems that go beyond common responses. Traditional chatbots often lack the contextual sensitivity and emotional depth required for meaningful therapeutic interaction. Many individuals avoid conventional therapy due to stigma or discomfort, making anonymous AI platforms a valuable alternative. This paper presents a novel multi-LLM framework for a psychologically aware chatbot that dynamically adapts to five therapeutic styles - Cognitive Behavioural Therapy(CBT), Person-Centred, Psycho-dynamic, Solution-Focused Brief Therapy(SFBT), and Dialectical Behaviour Therapy(DBT)based on user intent. An intent classifier selects the appropriate style, a second LLM generates the response, and a third independently evaluates its quality and fidelity. Key contributions include dynamic therapy style switching, a multi-scenario evaluation using varied LLM pairings (e.g., LLaMA-Gemma), and the use of LLMs as evaluators for empathy, guidance, and alignment. Across 250 distinct queries, the system achieved an average empathy score of 4.2/5, active listening score of 3.88/5, style adherence score of 4.92/5, and intent classification accuracy of 95%. Our work lays a foundation for adaptive, ethical, and person-centred AI support in settings where human therapy is inaccessible."
  },
  {
    "date": "2026-2-20",
    "title": "LLM PhishGuard: A GPT-3.5–Driven Framework with Heuristics, VirusTotal Reputation, and OCR for SME Email Security",
    "authors": "Adil Khan, Suleiman Y. Yerima",
    "publish": "2025 IEEE Smart World Congress (SWC)",
    "url": "https://doi.org/10.1109/swc65939.2025.00052",
    "source": "IEEE",
    "abstract": "Phishing remains one of the most persistent threats in cybersecurity, frequently serving as a gateway for data breaches, ransomware, and financial fraud. While large enterprises rely on advanced filtering systems, small and medium-sized enterprises (SMEs) often lack the resources or technical expertise to counter increasingly sophisticated phishing campaigns. These risks are amplified by social engineering, zero-day exploits, and hidden payloads. This paper introduces LLM PhishGuard—a lightweight, prompt-driven detection framework that combines OpenAI’s GPT-3.5 with practical heuristics and optional OCR. The system analyzes linguistic cues, domain reputation, SPF/DKIM indicators, domain age, and data extracted from suspicious URLs. Evaluated on a dataset of 59 emails drawn from real-world and corporate sources, PhishGuard achieved 95% accuracy and delivered structured, explainable outputs in downloadable JSON and PDF formats. It is the first lightweight framework to unify LLM reasoning, heuristics, and OCR in a modular, cost-effective design tailored for SME environments. Each message is processed in 5.3 seconds at a cost of approximately $0.002, offering a practical and scalable solution for resource-constrained organizations."
  },
  {
    "date": "2026-2-20",
    "title": "LLM-Enabled LAWNs: Toward Integrated Sensing, Communication, and Control",
    "authors": "Qingqing Cheng, Zhenguo Shi, Weijie Yuan, Yiyan Ma, Jiacheng Wang, Geng Sun",
    "publish": "IEEE Network",
    "url": "https://doi.org/10.1109/mnet.2026.3662101",
    "source": "IEEE",
    "abstract": "Low-altitude wireless networks (LAWNs) play an important role in supporting unmanned aerial vehicles (UAVs) and related services. However, achieving seamless integration of sensing, communication, and control remains a core challenge in dynamic environments, where traditional methods fall short in adaptability and efficiency. This paper investigates the integration of large language models (LLMs) and LAWNs to facilitate adaptive integrated sensing, communication, and control performance. We first outline foundational concepts of LAWNs and LLMs, including their main applications and strengths. Next, we examine the benefits and challenges of integrating LLMs and LAWNs. Additionally, we propose a novel LLM-enabled LAWN that dynamically integrates sensing for environmental perception, communication for robust data exchange, and control for precise trajectory management. A case study on urban UAV operations demonstrates clear performance gains: the proposed method reduces total route length by nearly 20% and achieves the highest average data rate among all benchmark planners while maintaining 95% sensing accuracy. These results show that LLM-driven decision support can improve both mission efficiency and communication quality in practical LAWNs."
  },
  {
    "date": "2026-2-20",
    "title": "Efficient Simulation and RTL Implementation of the SPECK Algorithm Using Verilog for Improved Cryptographic Security and Performance in VLSI Based Systems",
    "authors": "C Ravindranath, Syed Ateequr Rehman, G Kavya Shri, K Sindhu, G Pavithra, Swapnil S. Ninawe",
    "publish": "2025 IEEE 2nd International Conference on Green Industrial Electronics and Sustainable Technologies (GIEST)",
    "url": "https://doi.org/10.1109/giest66547.2025.11387089",
    "source": "IEEE",
    "abstract": "Cryptography plays an key role in ensuring data security in resources, such as IoT devices, built -in systems and wireless sensor networks. Speck algorithm is a light encryption block designed by the NSAs in 2014, which offers an balanced between securities & efficiencies. This project focuses on the design, simulation and implementation of the RTL algorithm with the Verilog. The primary objectives of this work include designing the effective Verilog code to verify its correctness through simulation. Their design includes the implementations of key expansion, encryption and decryption processes in optimization for area, performance and performance. The verilog -based design is simulated and verified by testing shots to ensure that correctness is correct. This work contributes to ongoing hardware security research by providing an efficient and scalable implementation of Speck -based verilog, suitable for IoT and built in systems. Index expressions Performance analysis, verilog, design RTL, encryption, key spot, expansion, simulation, light cryptography, decryption."
  },
  {
    "date": "2026-2-20",
    "title": "Verilog-Based Hardware Simulation and RTL Design of SPECK for Energy-Efficient Cryptographic Processing in Next-Generation VLSI Devices",
    "authors": "Manabala Dhana Lakshmi Saranya, Nagesh B. Mapari, Dipak J. Dahigaonkar, Ravi Srivastava, Rajesh B. Raut, T.C. Manjunath",
    "publish": "2025 International Conference on Innovations and Emerging Technologies In AI &amp;amp; Communication Systems (IETACS)",
    "url": "https://doi.org/10.1109/ietacs68750.2025.11385741",
    "source": "IEEE",
    "abstract": "There is lot of demands for secured type of communications in resource constrained platform, to name them, such as devices for IoT apps, processors which are embedded, WSNs, LAN, WAN, MAN, etc… and this has increased the vitality of the important applications in lightweighted cryptography needs. Many amongst them are the SPECK algo, which was enunciated by USA-NSA in the year 2013 and this stand tall for the simplicity in designs, has high through-puts & is very much used in <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$h / w$</tex> constrain environment. The proposed work gives a VHDL-depended <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$h / w$</tex> type of simulation based RTL-Registry Transferring Level Speck algo design with block-ciphering, to focus on efficient type of energy constrained cryptography processed tailor made devices for the next level of VLSI compatible components & systems. Here, what we have designed the key incorporations include the basic components such as decryption system, encryption system, both being optimization done w.r.t. the latency levels & area levels at the same time to maintain the reliability in computational speeds. Using structuring type of HDL-dependent models & verifications in the models developed, the proposed works highlights an algorithmic balance in the correct level of <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$h / w$</tex> efficiency, thus making it very much suitable for integrating into frame-worked IoT systems which has got good robustness in the protection of data & has minimal power consumptions for overhead. Experiments validations are done using Verilog based modelsim tools which will confirm the correct functioning of the developed R-T-L models w.r.t. a variety of test case studies, which emphasize the accuracies in scheduling of encryption & decryption keys for a variety of cycles. Finally, the overall performances in the analysis of speeds, operation, scalability, fast processing highlights the ability in the power design process for the VLSI applications w/o compromising the outputs.. Additionally, the project reflects on critical design parameters such as speed, area, and energy consumption, contributing novel insights into lightweight cipher hardware architectures for emerging VLSI systems."
  },
  {
    "date": "2026-2-20",
    "title": "HybridLog: LLM-Powered Log Anomaly Analysis with Heterogeneous Semantic Collaboration Training",
    "authors": "Hongwei Zuo, Fengxiao Tang, Yangfan Li, Ming Zhao, Rui Wang, Jinke Liu",
    "publish": "2025 IEEE Smart World Congress (SWC)",
    "url": "https://doi.org/10.1109/swc65939.2025.00123",
    "source": "IEEE",
    "abstract": "Log anomaly detection is a critical technology for ensuring reliability and operational efficiency in software systems. Traditional methods often face challenges, particularly those related to log parsing complexities that can lead to information loss and consequently high false positive rates. While detection identifies issues, understanding them is also vital. Existing workflow-based approaches offer some explanation by comparing anomalous sequences against normal patterns. There is also a lack of semantic-level anomaly diagnosis capabilities. In this paper, we propose a novel approach named HybirdLog, which focuses on the detection and diagnosis of log anomalies. It introduces heterogeneous semantic collaborative training, integrating anomaly features extracted by LLMs, jointly encoding semantic information and anomaly tendencies. Our approach achieves low-resource cross-domain anomaly detection and interpretability of anomalies. Experimental validation on two public datasets demonstrates the leading performance of our proposed method, offering an efficient and interpretable solution for analyzing logs from software systems."
  },
  {
    "date": "2026-2-20",
    "title": "Stochastic Streets: A Walk Through Random LLM Address Generation in Four European Cities",
    "authors": "Tairan Fu, David Nazareno-Campo, Javier Coronado-Blázquez, Javier Conde, Pedro Reviriego, Fabrizio Lombardi",
    "publish": "Computer",
    "url": "https://doi.org/10.1109/mc.2025.3611067",
    "source": "IEEE",
    "abstract": "Large language models are capable of solving complex math problems or answering difficult questions on almost any topic, but can they generate random street addresses for European cities?"
  },
  {
    "date": "2026-2-20",
    "title": "A Task-Specific Fine-Tuning Strategy and Evaluation for LLM-based Log Analysis",
    "authors": "Bin Li, Siyang Lu, Ningning Han, Xiang Wei, Wei Lu",
    "publish": "2025 IEEE Smart World Congress (SWC)",
    "url": "https://doi.org/10.1109/swc65939.2025.00172",
    "source": "IEEE",
    "abstract": "While recent advances in deep learning have led to lightweight models capable of performing automatic log analysis with high accuracy, the emergence of large language models (LLMs) has opened up new possibilities in this domain. However, these studies often focus only on improving performance and robustness, overlooking real-world industrial scenarios. In addition, these studies vary greatly in terms of model complexity, training data volume, and fine-tuning methods, making it difficult to conduct a fair comparison and highlighting the need for standardized evaluation metrics. In this paper, we propose a hierarchical LoRA fine-tuning strategy that enables LLMs to efficiently adapt to log data and perform related analysis tasks with improved parameter efficiency. Additionally, we introduce a comprehensive set of evaluation metrics tailored for log analysis with LLMs, designed to evaluate the performance of LLM-based log analysis from multiple perspectives in a fair manner. Through extensive experiments on publicly available log datasets, we demonstrate that our fine-tuning approach achieves a favorable balance between downstream performance and memory overhead. We further validate the practicality of our proposed evaluation framework by evaluating a range of existing LLM-based log analysis approaches."
  },
  {
    "date": "2026-2-20",
    "title": "Mitigating Item-Side Unfairness in LLM-Enhanced Recommender Systems",
    "authors": "Miaolin Xing, Jielong Zhou, Shunmei Meng, Qixin Guan",
    "publish": "2025 IEEE Smart World Congress (SWC)",
    "url": "https://doi.org/10.1109/swc65939.2025.00120",
    "source": "IEEE",
    "abstract": "Recommendation systems play a crucial role in helping users navigate vast amounts of online information by providing personalized content suggestions. Recent advancements have explored leveraging large language models (LLMs) to enhance graph neural network-based recommendation models by generating rich textual representations of user and item interests. However, existing methods that incorporate LLMs may amplify preferences for mainstream item categories, potentially leading to item-side unfairness. To address this issue, we propose a novel fairness-aware LLM-enhanced recommendation system. Rather than directly integrating LLM-generated interest documents, we employ multiple masking generators to extract diverse user preferences, mitigating the overrepresentation of mainstream interests. Furthermore, we propose a fairness-aware dynamic adjustment method for the user-item interaction matrix, which discards interactions associated with overexposed item categories during training, aiming to balance the distribution of recommendation scores. We conducted extensive experiments on three benchmark recommendation datasets using six different collaborative filtering models as baselines. The results demonstrate that our approach not only improves recommendation performance but also effectively alleviates item-side unfairness, highlighting its potential for achieving fair and balanced personalized recommendations."
  },
  {
    "date": "2026-2-20",
    "title": "An Llm-Enhanced Physics-Informed Spatiotemporal Neural Network for Lithium-Ion Battery Modeling",
    "authors": "Fengyuan Wang, Haohao Feng, Mifeng Ren, Jianhua Zhang, Wenjie Zhang",
    "publish": "2025 Third International Conference on Cyber-Energy Systems and Intelligent Energy (ICCSIE)",
    "url": "https://doi.org/10.1109/iccsie67394.2025.11378610",
    "source": "IEEE",
    "abstract": "Gaining a deep understanding of the internal mechanisms of lithium-ion batteries and establishing highprecision battery models are key technologies for assessing the safety status and predicting the lifespan of energy storage systems. Compared to other traditional models, the P2D model can accurately describe the dynamic electrochemical processes of lithium-ion batteries. However, the model consists of complex nonlinear coupled partial differential equations, and how to better solve these equations has become a challenging task. Although PINNs models integrate physical constraints with data-driven approaches to solve P2D models, they face challenges in obtaining required electrochemical data, exhibit poor dynamic adaptability, and underutilize historical information. Therefore, this paper develops an LLM-PISN lithium-ion battery modeling method. Specifically, it first utilizes a large language model to generate pseudo-label values. Battery data is then segmented in the time domain, and spatiotemporal dynamics are predicted using a CNN-LSTM network with historical data. Finally, a P2D model is introduced as a mechanistic constraint to ensure the physical consistency of the final output. Experimental validation demonstrates the effectiveness of the proposed modeling approach."
  },
  {
    "date": "2026-2-20",
    "title": "Embodied LLM Agents Learn to Cooperate in Organized Teams",
    "authors": "Xudong Guo, Kaixuan Huang, Jiale Liu, Wenhui Fan, Natalia Vélez, Qingyun Wu, Huazheng Wang, Thomas L. Griffiths, Mengdi Wang",
    "publish": "IEEE Transactions on Computational Social Systems",
    "url": "https://doi.org/10.1109/tcss.2025.3637527",
    "source": "IEEE",
    "abstract": "Large language models (LLMs) have emerged as integral tools for reasoning, planning, and decision-making, drawing upon their extensive world knowledge and proficiency in language-related tasks. LLMs thus hold tremendous potential for natural language interaction within multiagent systems to foster cooperation. However, LLM agents tend to over-report and comply with any instruction, which may result in information redundancy and confusion in multiagent cooperation. Inspired by human organizations, this article introduces a framework that imposes prompt-based organization structures on LLM agents to mitigate these problems. Through a series of experiments with embodied LLM agents and human–agent collaboration, our results highlight the impact of designated leadership on team efficiency, shedding light on the leadership qualities displayed by LLM agents and their spontaneous cooperative behaviors. Further, we harness the potential of LLMs to propose enhanced organizational prompts, via a <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">criticize-reflect</i> process, resulting in novel organization structures that reduce communication costs and enhance team efficiency."
  },
  {
    "date": "2026-2-20",
    "title": "CrowdShield: A Smartphone-Based AIoT Framework for Real-Time Women's Safety Using Emotion-Aware Voice Recognition and LLM-Powered Alert Classification",
    "authors": "Amal Anand, Aswinth Narayan A, Aditya Narayan, Abhinand Titus, Kailas Krishna K S, Sanjay S Kumar",
    "publish": "2025 International Conference on Computing and Communications (COMPUTINGCON)",
    "url": "https://doi.org/10.1109/computingcon64838.2025.11378017",
    "source": "IEEE",
    "abstract": "Women's safety in public and private spaces remains a pressing global concern, often exacerbated by the limitations of conventional safety tools that require manual interaction during distress. This paper introduces CrowdShield, a smartphone-based AIoT framework that enables real-time emergency detection and multi-channel alert dissemination using speech emotion recognition and intent classification. The system integrates lightweight on-device convolutional recurrent neural networks (CRNNs) for emotion detection and quantized large language models (LLMs) for contextual intent understanding. Voice inputs are analyzed locally to preserve user privacy, with alerts propagated through a hybrid communication strategy combining Bluetooth mesh, cellular SMS, and cloud messaging. Privacy is ensured through ephemeral audio buffers, anonymization, and end-to-end encryption. Evaluated on standard emotion datasets (RAVDESS, CREMAD) and multilingual voice samples, CrowdShield achieves 91.3% emotion classification accuracy and sub-3s end-to-end alert latency, with low energy overhead. The system demonstrates robust performance across diverse use-case scenarios, including public transport and isolated environments. By combining edge AI, ethical design, and resilient communication, CrowdShield establishes a scalable foundation for enhancing women's safety through proactive and privacy-conscious intervention."
  },
  {
    "date": "2026-2-20",
    "title": "A Novel LLM-Assisted Approach for Automated Mechanical Design of Regularized Geometries in CAD system",
    "authors": "SungHyun Kim, ChoongSung Lee, JongWon Park",
    "publish": "IEEE Access",
    "url": "https://doi.org/10.1109/access.2026.3666652",
    "source": "IEEE",
    "abstract": "Modern product development spans a long lifecycle from planning to design, simulation, manufacturing, and customer delivery. Manufacturers place great emphasis on reducing development lead time to strengthen competitiveness. In recent manufacturing industries, most designed components feature standardized and structured geometric configurations, which can be efficiently generated through parametric design methodologies. With the rapid advancement of artificial intelligence (AI) and large language models (LLMs), research that integrates these technologies into the design and 3D simulation stages has gained increasing attention. This paper proposes a practical LLM-assisted framework for automated mechanical design of regularized geometries in a CAD system. Unlike data-driven generative CAD approaches that require large-scale CAD training datasets and may not guarantee strict dimensional correctness, the proposed method executes predefined parametric templates implemented via CAD APIs, while using an LLM to translate natural-language design intents into executable command-line instructions and to support interactive parameter refinement. A case study on ball bearing design demonstrates that the proposed framework reduces per-instance design execution time by approximately 94–95% compared to conventional manual CAD modeling, while generating CAD-native outputs that can be directly extended to downstream CAE and manufacturing workflows."
  },
  {
    "date": "2026-2-20",
    "title": "Offline Signature Verification: ArcFace Evaluation Under Noise and Geometric Distortions",
    "authors": "Femila Irene G, Surendran R",
    "publish": "2025 International Conference on Computing and Communications (COMPUTINGCON)",
    "url": "https://doi.org/10.1109/computingcon64838.2025.11377171",
    "source": "IEEE",
    "abstract": "In this paper, work explore the performance of an ArcFace-based deep learning model in offline signature verification regarding its robustness to noise and geometric distortions. The model was trained using a diverse collection of real and forged signatures and tested on an unseen Separate Test Set. On clean test data, the model had a ROC AUC of 0.8783, and Equal Error Rate (EER) of 0.2071, indicating good discriminative power between real and fake signatures. Robustness analysis indicated that the performance steadily decreases with an increase in the amount of Gaussian, salt-andpepper, and speckle noise, resulting in lower ROC AUC values and higher EER. In the same manner, geometric distortions impaired verification accuracies where translation and combined distortions were the most degrading compared to moderate rotations or shears. This observation demonstrates the ArcFace framework in terms of offline signature verification yet emphasizes its sensitivity to practical degradation. Future research will be done in terms of data augmentation, robust architectures, and hybrid methods to enhance resistance to noise and distortions in real-world scenarios."
  },
  {
    "date": "2026-2-20",
    "title": "Vul-RAG: Enhancing LLM-based Vulnerability Detection via Knowledge-level RAG",
    "authors": "Xueying Du, Geng Zheng, Kaixin Wang, Yi Zou, Yujia Wang, Wentai Deng, Jiayi Feng, Mingwei Liu, Bihuan Chen, Xin Peng, Tao Ma, Yiling Lou",
    "publish": "ACM Transactions on Software Engineering and Methodology",
    "url": "https://doi.org/10.1145/3797277",
    "source": "ACM",
    "abstract": "None"
  },
  {
    "date": "2026-2-20",
    "title": "Towards Efficient Formal Verification of GRAFCET Specifications Using LLMs",
    "authors": "Darko Divkovic, Gianluca Manca, Franz C. Kunze, Alexander Fay",
    "publish": "2025 IEEE 4th Industrial Electronics Society Annual On-Line Conference (ONCON)",
    "url": "https://doi.org/10.1109/oncon68412.2025.11384202",
    "source": "IEEE",
    "abstract": "Verifying critical properties in GRAFCET specifications of control code - such as safety, state reachability, and dead-lock avoidance - is essential for ensuring reliable automation. Model checking is a well-established formal verification method for this purpose, but it often suffers from state space explosion. Static analysis, on the other hand, can reduce the computational load of model checking by providing auxiliary information and ensuring formal correctness by detecting structural errors and suggesting syntactic corrections. However, it cannot capture errors arising from semantic properties without domain knowledge, e.g., mutually exclusive variables or physically impossible states. This paper proposes a hybrid verification approach that combines static analysis and Large Language Models (LLMs) to overcome this limitation of static analysis. The proposed hybrid method was applied to an industrial-scale GRAFCET specification and successfully identified model errors that cannot be detected by classical static analysis without domain knowledge."
  },
  {
    "date": "2026-2-20",
    "title": "Evaluating Functional Verification Strategies for the Controller Area Network (CAN) Protocol",
    "authors": "Seema Kumari, Khushboo Singh, Ajay Kumar, Basudeba Behera",
    "publish": "2025 IEEE 2nd International Conference on Green Industrial Electronics and Sustainable Technologies (GIEST)",
    "url": "https://doi.org/10.1109/giest66547.2025.11387708",
    "source": "IEEE",
    "abstract": "The Controller Area Network (CAN) protocol is a foundational communication standard in automotive, industrial, and embedded systems, where reliability is paramount due to safety-critical requirements. This article presents a comprehensive survey of verification methodologies for the CAN protocol, including simulation-based testing, formal verification, hardware-in-the-loop (HIL) testing, and emulation. Each approach is evaluated in terms of its strengths, limitations, and commonly used tools, offering insights into their effectiveness in ensuring protocol compliance. The study also outlines key challenges, recent technological advancements, and potential future directions to support informed decision-making in CAN verification efforts. Furthermore, simulation-based validation of core CAN components—specifically the Controller, Transceiver, and Arbitration units—was conducted. Results demonstrated correct behavior in data transmission, reception, and arbitration processes, reinforcing simulation as a reliable strategy for CAN protocol verification."
  }
]