[
  {
    "date": "2026-02-17",
    "title": "Iterative LLM-Based Assertion Generation Using Syntax-Semantic Representations for Functional Coverage-Guided Verification",
    "authors": "Yonghao Wang, Jiaxin Zhou, Yang Yin, Hongqin Lyu, Zhiteng Chao, Wenchao Ding, Jing Ye, Tiancheng Wang, Huawei Li",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15388v1",
    "source": "arXiv",
    "abstract": "While leveraging LLMs to automatically generate SystemVerilog assertions (SVAs) from natural language specifications holds great potential, existing techniques face a key challenge: LLMs often lack sufficient understanding of IC design, leading to poor assertion quality in a single pass. Therefore, verifying whether the generated assertions effectively cover the functional specifications and designing feedback mechanisms based on this coverage remain significant hurdles. To address these limitations, this paper introduces CoverAssert, a novel iterative framework for optimizing SVA generation with LLMs. The core contribution is a lightweight mechanism for matching generated assertions with specific functional descriptions in the specifications. CoverAssert achieves this by clustering the joint representations of semantic features of LLM-generated assertions and structural features extracted from abstract syntax trees (ASTs) about signals related to assertions, and then mapping them back to the specifications to analyze functional coverage quality. Leveraging this capability, CoverAssert constructs a feedback loop based on functional coverage to guide LLMs in prioritizing uncovered functional points, thereby iteratively improving assertion quality. Experimental evaluations on four open-source designs demonstrate that integrating CoverAssert with state-of-the-art generators, AssertLLM and Spec2Assertion, achieves average improvements of 9.57 % in branch coverage, 9.64 % in statement coverage, and 15.69 % in toggle coverage.",
    "title_zh": "基于语法-语义表示的迭代LLM断言生成用于功能覆盖引导的验证",
    "abstract_zh": "尽管利用大型语言模型（LLMs）从自然语言规范中自动生成SystemVerilog断言（SVAs）具有巨大潜力，但现有技术面临一个关键挑战：LLMs通常对集成电路设计缺乏足够的理解，导致单次生成的断言质量较差。因此，验证生成的断言是否有效覆盖功能规范并设计基于此覆盖的反馈机制仍然是重大难题。为了解决这些限制，本文介绍了CoverAssert，这是一种用于优化LLM生成SVA的创新迭代框架。其核心贡献是提供了一种轻量级机制，用于将生成的断言与规范中的特定功能描述进行匹配。CoverAssert通过对LLM生成的断言的语义特征和从与断言相关的信号的抽象语法树（ASTs）中提取的结构特征的联合表示进行聚类，然后将其映射回规范以分析功能覆盖质量。利用这一能力，CoverAssert构建了一个基于功能覆盖的反馈循环，以指导LLMs优先处理未覆盖的功能点，从而迭代地提高断言质量。在四个开源设计上的实验评估表明，将CoverAssert与最先进的生成器AssertLLM和Spec2Assertion结合使用，在分支覆盖率上平均提高了9.57%，在语句覆盖率上提高了9.64%，在切换覆盖率上提高了15.69%。"
  },
  {
    "date": "2026-02-16",
    "title": "GenAI for Systems: Recurring Challenges and Design Principles from Software to Silicon",
    "authors": "Arya Tschand, Chenyu Wang, Zishen Wan, Andrew Cheng, Ioana Cristescu, Kevin He, Howard Huang, Alexander Ingare, Akseli Kangaslahti, Sara Kangaslahti, Theo Lebryk, Hongjin Lin, Jeffrey Jian Ma, Alexandru Meterez, Clara Mohri, Depen Morwani, Sunny Qin, Roy Rinberg, Paula Rodriguez-Diaz, Alyssa Mia Taliotis, Pernille Undrum Fathi, Rosie Zhao, Todd Zhou, Vijay Janapa Reddi",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2602.15241v1",
    "source": "arXiv",
    "abstract": "Generative AI is reshaping how computing systems are designed, optimized, and built, yet research remains fragmented across software, architecture, and chip design communities. This paper takes a cross-stack perspective, examining how generative models are being applied from code generation and distributed runtimes through hardware design space exploration to RTL synthesis, physical layout, and verification. Rather than reviewing each layer in isolation, we analyze how the same structural difficulties and effective responses recur across the stack. Our central finding is one of convergence. Despite the diversity of domains and tools, the field keeps encountering five recurring challenges (the feedback loop crisis, the tacit knowledge problem, trust and validation, co-design across boundaries, and the shift from determinism to dynamism) and keeps arriving at five design principles that independently emerge as effective responses (embracing hybrid approaches, designing for continuous feedback, separating concerns by role, matching methods to problem structure, and building on decades of systems knowledge). We organize these into a challenge--principle map that serves as a diagnostic and design aid, showing which principles have proven effective for which challenges across layers. Through concrete cross-stack examples, we show how systems navigate this map as they mature, and argue that the field needs shared engineering methodology, including common vocabularies, cross-layer benchmarks, and systematic design practices, so that progress compounds across communities rather than being rediscovered in each one. Our analysis covers more than 275 papers spanning eleven application areas across three layers of the computing stack, and distills open research questions that become visible only from a cross-layer vantage point.",
    "title_zh": "面向系统的生成式人工智能：从软件到硅片的反复挑战和设计原则",
    "abstract_zh": "生成式人工智能正在重塑计算系统的设计、优化和构建方式，但研究仍然在软件、架构和芯片设计社区中呈现碎片化。本论文从跨栈的视角出发，探讨生成模型如何应用于从代码生成和分布式运行时到硬件设计空间探索，再到RTL综合、物理布局和验证。我们并不孤立地审视每一层，而是分析相同的结构性困难和有效应对措施如何在整个栈中反复出现。我们的核心发现是趋同。尽管领域和工具多样化，该领域不断遇到五个反复出现的挑战（反馈回路危机、隐性知识问题、信任与验证、跨界协同设计以及从确定性到动态性的转变），并不断得出五个独立出现的有效设计原则（采用混合方法、设计连续反馈、按角色分离关注点、将方法与问题结构匹配以及建立在数十年的系统知识之上）。我们将这些组织成一个挑战—原则图，作为诊断和设计的辅助工具，展示哪些原则在跨层挑战中被证明是有效的。通过具体的跨栈实例，我们展示了系统如何在成熟过程中导航这一图谱，并主张该领域需要共享的工程方法，包括通用词汇、跨层基准和系统化设计实践，以便进展在各个社区中累积，而不是在每个社区中被重新发现。我们的分析涵盖了超过275篇论文，涉及三个计算栈层的十一种应用领域，并提炼出只有从跨层视角才能显现的开放研究问题。"
  },
  {
    "date": "2026-2-17",
    "title": "GARNETT: Graph-based Fast yet Accurate Post-Placement Toggle Rate Prediction Model from RTL without Technology-dependent Logic Synthesis and Placement",
    "authors": "M B Rakesh, Anant Terkar, Pabitra Das, Amit Acharyya",
    "publish": "IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems",
    "url": "https://doi.org/10.1109/tcad.2026.3665686",
    "source": "IEEE",
    "abstract": "We propose a novel high-speed yet accurate GrAph-assisted post-placement prediction model that predicts the average Toggle rate of ASIC Design from RTL, skipping placEmenT, logic syNthesis and gate-level simulation. We present an efficient graph representation learning solution by sufficiently training the proposed GARNETT using a custom features-assisted graph neural network (GNN) architecture on the unbiased distribution of logic cells in translated technology-independent (TTI) netlist, achieved by bypassing technology-dependent logic synthesis and placement. This unbiased training ensures GARNETT’s efficient learning to propagate the toggle rates with our GNN by effectively embedding the feature values as vectors on each logic cell, unlike the biased training with post-synthesized netlist files in state-of-the-art (SoA) architectures, GRANNITE, Method, and GRIPT. The proposed GARNETT achieves a mean improvement in accuracy of 23.31%, 4.47%, 2.1% and 2.74% higher than the commercial RTL toggle rate estimation tool, GRANNITE, SoA Method, and GRIPT in predicting the average toggle rate, respectively. The proposed GARNETT is faster than the commercial placement-level toggle rate estimation tool, GRANNITE, SoA Method, and GRIPT, in inference latency, with a mean improvement of 6.08X, 4.05X, 4.09X, and 4.03X, respectively.",
    "title_zh": "GARNETT：基于图的快速且准确的后布局翻转率预测模型，无需依赖技术的逻辑综合和布局",
    "abstract_zh": "我们提出了一种新颖的高速且准确的图辅助后布局预测模型，该模型从RTL预测ASIC设计的平均翻转率，跳过布局、逻辑综合和门级仿真。我们通过充分训练所提出的GARNETT，使用定制特征辅助的图神经网络（GNN）架构，在翻译后的技术无关（TTI）网表中逻辑单元的无偏分布上，提出了一种高效的图表示学习解决方案。这种无偏训练确保了GARNETT能够有效学习，通过我们的GNN传播翻转率，方法是将特征值有效地嵌入为每个逻辑单元上的向量，这与在最先进（SoA）架构GRANNITE、Method和GRIPT中使用后综合网表文件进行的有偏训练不同。所提出的GARNETT在预测平均翻转率方面的准确性比商业RTL翻转率估算工具、GRANNITE、SoA Method和GRIPT分别提高了23.31%、4.47%、2.1%和2.74%。所提出的GARNETT在推理延迟方面比商业布局级翻转率估算工具、GRANNITE、SoA Method和GRIPT更快，平均提高了6.08倍、4.05倍、4.09倍和4.03倍。"
  }
]