[
  {
    "date": "2026-01-20",
    "title": "Report for NSF Workshop on AI for Electronic Design Automation",
    "authors": "Deming Chen, Vijay Ganesh, Weikai Li, Yingyan, Lin, Yong Liu, Subhasish Mitra, David Z. Pan, Ruchir Puri, Jason Cong, Yizhou Sun",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2601.14541v1",
    "source": "arXiv",
    "abstract": "This report distills the discussions and recommendations from the NSF Workshop on AI for Electronic Design Automation (EDA), held on December 10, 2024 in Vancouver alongside NeurIPS 2024. Bringing together experts across machine learning and EDA, the workshop examined how AI-spanning large language models (LLMs), graph neural networks (GNNs), reinforcement learning (RL), neurosymbolic methods, etc.-can facilitate EDA and shorten design turnaround. The workshop includes four themes: (1) AI for physical synthesis and design for manufacturing (DFM), discussing challenges in physical manufacturing process and potential AI applications; (2) AI for high-level and logic-level synthesis (HLS/LLS), covering pragma insertion, program transformation, RTL code generation, etc.; (3) AI toolbox for optimization and design, discussing frontier AI developments that could potentially be applied to EDA tasks; and (4) AI for test and verification, including LLM-assisted verification tools, ML-augmented SAT solving, security/reliability challenges, etc. The report recommends NSF to foster AI/EDA collaboration, invest in foundational AI for EDA, develop robust data infrastructures, promote scalable compute infrastructure, and invest in workforce development to democratize hardware design and enable next-generation hardware systems. The workshop information can be found on the website https://ai4eda-workshop.github.io/.",
    "title_zh": "国家科学基金会关于电子设计自动化的人工智能研讨会报告",
    "abstract_zh": "本报告总结了2024年12月10日在温哥华与NeurIPS 2024同期举行的国家科学基金会关于电子设计自动化（EDA）的人工智能研讨会的讨论和建议。研讨会汇集了机器学习和EDA领域的专家，探讨了如何利用人工智能，包括大型语言模型（LLMs）、图神经网络（GNNs）、强化学习（RL）、神经符号方法等，来促进EDA并缩短设计周期。研讨会涵盖四个主题：（1）物理综合和制造设计（DFM）的人工智能，讨论物理制造过程中的挑战和潜在的人工智能应用；（2）高层次和逻辑层次综合（HLS/LLS）的人工智能，涉及编译指示插入、程序转换、RTL代码生成等；（3）优化和设计的人工智能工具箱，讨论可能应用于EDA任务的前沿人工智能发展；（4）测试和验证的人工智能，包括LLM辅助验证工具、机器学习增强的SAT求解、安全性/可靠性挑战等。报告建议国家科学基金会促进人工智能与EDA的合作，投资于EDA的基础人工智能，开发稳健的数据基础设施，推广可扩展的计算基础设施，并投资于劳动力发展，以普及硬件设计并实现下一代硬件系统。研讨会信息可在网站https://ai4eda-workshop.github.io/上找到。"
  }
]