[
  {
    "date": "2026-01-27",
    "title": "Veri-Sure: A Contract-Aware Multi-Agent Framework with Temporal Tracing and Formal Verification for Correct RTL Code Generation",
    "authors": "Jiale Liu, Taiyu Zhou, Tianqi Jiang",
    "publish": "arXiv",
    "url": "https://arxiv.org/abs/2601.19747v1",
    "source": "arXiv",
    "abstract": "In the rapidly evolving field of Electronic Design Automation (EDA), the deployment of Large Language Models (LLMs) for Register-Transfer Level (RTL) design has emerged as a promising direction. However, silicon-grade correctness remains bottlenecked by: (i) limited test coverage and reliability of simulation-centric evaluation, (ii) regressions and repair hallucinations introduced by iterative debugging, and (iii) semantic drift as intent is reinterpreted across agent handoffs. In this work, we propose Veri-Sure, a multi-agent framework that establishes a design contract to align agents' intent and uses a patching mechanism guided by static dependency slicing to perform precise, localized repairs. By integrating a multi-branch verification pipeline that combines trace-driven temporal analysis with formal verification consisting of assertion-based checking and boolean equivalence proofs, Veri-Sure enables functional correctness beyond pure simulations. We also introduce VerilogEval-v2-EXT, extending the original benchmark with 53 more industrial-grade design tasks and stratified difficulty levels, and show that Veri-Sure achieves state-of-the-art verified-correct RTL code generation performance, surpassing standalone LLMs and prior agentic systems.",
    "title_zh": "Veri-Sure：一种具备时间追踪和形式验证的合约感知多代理框架，用于生成正确的RTL代码",
    "abstract_zh": "在快速发展的电子设计自动化（EDA）领域，使用大型语言模型（LLMs）进行寄存器传输级（RTL）设计已成为一个有前景的方向。然而，达到硅级正确性仍然受到以下因素的制约：（i）测试覆盖率有限和以仿真为中心的评估可靠性不足，（ii）迭代调试引入的回归和修复幻觉，以及（iii）在代理交接过程中意图被重新解释导致的语义漂移。在这项工作中，我们提出了Veri-Sure，一个多代理框架，通过建立设计合约来对齐代理的意图，并使用静态依赖切片指导的修补机制进行精确的局部修复。通过整合一个多分支验证管道，该管道结合了基于轨迹的时间分析和由断言检查及布尔等价证明组成的形式验证，Veri-Sure实现了超越纯仿真的功能正确性。我们还引入了VerilogEval-v2-EXT，扩展了原有基准测试，增加了53个工业级设计任务和分层难度级别，并展示了Veri-Sure在经过验证的正确RTL代码生成性能上达到了最先进的水平，超越了独立的LLMs和先前的代理系统。"
  }
]